serifpersia/pianolux-esp32/ESP32_PianoLux/ESP32_PianoLux.ino
/*
  PianoLux on ESP32S2/S3 boards is an open-source project that aims to provide MIDI-based LED control to the masses.
  It is developed by a one-person team, yours truly, known as serifpersia, or Scarlett.

  If you modify this code and redistribute the PianoLux project, please ensure that you
  don't remove this disclaimer or appropriately credit the original author of the project
  by linking to the project's source on GitHub: github.com/serifpersia/pianolux-esp32/
  Failure to comply with these terms would constitute a violation of the project's
  MIT license under which PianoLux is released.

  Copyright © 2023-2024 Serif Rami, also known as serifpersia.

*/

// PianoLux

// Install ESP32 arduino core sdk to be able to compile and upload code to esp32 boards
// Use my modified sdks for esp32 s2/s3 to have modified USB Descriptor value from 256 to 4096
// to support all USB MIDI devices! (replace the esp32s2 or s3 sdk folders in
// Arduino15\packages\esp32\hardware\esp32\2.0.14\tools\sdk
// link: https://drive.google.com/drive/folders/1WlxvhdeabNDGIs6hM0zICGuerMvHKQSR?usp=sharing.

// Download libs needed use the install_lib.bat script to do it
// automatically or look into that file and download zips from the links
// and extract to your Arduino/libraries folder(ESP32PartitionTool in Arduino/tools(create tools folder
// if you don't have it already).

// Restart Arduino IDE  if its open and select correct esp32 dev board.

// Change BOARD_TYPE to match your board, default board selected is ESP32S3
// Under Tools>Partition schemes select HUGE App/NO OTA/1MB SPIFFS, this lets Arduino IDE know that
// you want to use custom partitions.csv file included in the sketch folder.

// Change LED Strip Data pin from default pin 18 to some other pin your led strip is connected
// on your esp32 board, you can find this in config.cfg file in sketch location/data directory.

// Open ESP32PartitionTool, select LittleFS under SPIFFS section and press Merge binary & Upload.
// Once completed, connect your WiFi device(phone/laptop/PC with WiFi) to PianoLux Portal AP WiFi and set ESP32 to your local router network.
// Once this AP is no longer visible your ESP32 should show you your IP, you might need to recconect the board or press reset button to see it.
// Connect to PianoLux web interface via ip the link should look like http://192.168.1.32/ or use pianolux.local http://pianolux.local/.

String firmwareVersion = "v1.12";

// Define board types with unique values
#define ESP32    1
#define ESP32S2  2
#define ESP32S3  3

// Define the actual board type (change this based on your board)
#define BOARD_TYPE ESP32S3 // select your board: ESP32, ESP32S2, or ESP32S3

#if BOARD_TYPE == ESP32S3
#include <BLEMidi.h>
#include <usb/usb_host.h>
#include "usbhhelp.hpp"
#elif BOARD_TYPE == ESP32S2
#include <usb/usb_host.h>
#include "usbhhelp.hpp"
#elif BOARD_TYPE == ESP32
#include <BLEMidi.h>
#else
#error "Unsupported board type!"
#endif

// Define flags to choose libraries
#define USE_ARDUINO_OTA 0 // Set to 1 to use ArduinoOTA, 0 to not use
#define USE_ELEGANT_OTA 1 // Set to 1 to use ElegantOTA, 0 to not use


// WIFI Libs
#include <WiFiManager.h>
#include <ESPmDNS.h>

#include <AsyncTCP.h>
#include <ArduinoJson.h>
#include <ESPAsyncWebServer.h>
#include <WebSocketsServer.h>

#if USE_ARDUINO_OTA
#include <ArduinoOTA.h>
#elif USE_ELEGANT_OTA
#include <ElegantOTA.h>
#endif

// ESP Storage Library
#include <LittleFS.h>

// rtpMIDI
#define NO_SESSION_NAME
#include <AppleMIDI.h>

#include <WebSerial.h>

//FastLED Library
#include <FastLED.h>
#include "FadingRunEffect.h"
#include "FadeController.h"


//RMT LED STRIP INIT
#include "w2812-rmt.hpp"

#include "ESP32MidiPlayer.h"


#include <freertos/FreeRTOS.h>
#include <freertos/queue.h>

#if BOARD_TYPE == ESP32S3 || BOARD_TYPE == ESP32S2
// Define a structure for MIDI messages
typedef struct {
  uint8_t status; // e.g., 0x90 for Note On, 0x80 for Note Off
  uint8_t channel;
  uint8_t data1; // Note number or Controller number
  uint8_t data2; // Velocity or Value
} MidiMessage;

// Define Queue Handle and Size
#define MIDI_OUT_QUEUE_SIZE 16 // Adjust size as needed
static QueueHandle_t midiOutQueue = NULL;

bool isMIDI = false;
bool isMIDIReady = false;

const size_t MIDI_IN_BUFFERS = 8;
const size_t MIDI_OUT_BUFFERS = 8;
usb_transfer_t *MIDIOut = NULL;
usb_transfer_t *MIDIIn[MIDI_IN_BUFFERS] = { NULL };

// Flag to track if the USB OUT transfer is busy
static volatile bool midiOutBusy = false; // Volatile: accessed by callback and main tasks
#endif

// Initialization of webserver and websocket
AsyncWebServer server(80);
WebSocketsServer webSocket(81);

APPLEMIDI_CREATE_DEFAULTSESSION_INSTANCE(); // Creates global MIDI object

ESP32MidiPlayer midiPlayer(LittleFS); // Use LittleFS

String currentLoadedFile = ""; // Declare currentLoadedFile globally
uint8_t isConnected = 0; // Declare isConnected globally


// Constants for LED strip
#define UPDATES_PER_SECOND 60
#define MAX_NUM_LEDS 176    // How many LEDs do you want to control
#define MAX_EFFECTS 128


ESP32RMT_WS2812B<GRB>* wsstripGRB;
ESP32RMT_WS2812B<RGB>* wsstripRGB;
ESP32RMT_WS2812B<BRG>* wsstripBRG;

FadingRunEffect* effects[MAX_EFFECTS];
FadeController* fadeCtrl = new FadeController();


uint8_t DEFAULT_BRIGHTNESS = 255;
uint8_t NUM_LEDS = 176;       // How many LEDs you want to control
uint8_t STRIP_DIRECTION = 0;  // 0 - left-to-right

uint8_t generalFadeRate = 255;
uint8_t numEffects = 0;

uint8_t lowestNote = 21;    // MIDI note A0
uint8_t highestNote = 108;  // MIDI note C8 (adjust as needed)
uint8_t useFix;
uint8_t pianoScaleRatio;

uint8_t  getHueForPos(uint8_t pos) {
  return pos * 255 / NUM_LEDS;
}

uint8_t ledNum(uint8_t i) {
  return STRIP_DIRECTION == 0 ? i : (NUM_LEDS - 1) - i;
}

CRGB leds[MAX_NUM_LEDS];
CRGB bgColor = CRGB::Black;
CRGB guideColor = CRGB::Black;

boolean bgOn = false;
boolean keysOn[MAX_NUM_LEDS];

boolean isOnStrip(uint8_t pos) {
  return pos >= 0 && pos < NUM_LEDS;
}

uint8_t hue = 0;
uint8_t brightness = 255;
uint8_t saturation = 255;
uint8_t bgBrightness = 128;

#define HUE_CHANGE_SPEED 1 // Adjust this value to control the speed of hue change

uint8_t currentHue[MAX_NUM_LEDS] = {0}; // Array to store current hue value for each LED


// Define split positions (percentage)
uint8_t splitPosition = 50;  // Example: 50 means the split is in the middle
uint8_t splitLeftMinPitch = 21;
uint8_t splitRightMaxPitch = 108;

// Define split colors
CHSV splitLeftColor = CHSV(0, 255, 255);     // Red color
CHSV splitRightColor = CHSV(160, 255, 255);  // Blue color

uint8_t bgToggle;
uint8_t fixToggle;
uint8_t reverseToggle;
uint8_t bgUpdateToggle = 1;
uint8_t keySizeVal;

uint8_t LED_PIN;
uint8_t COLOR_PRESET;
uint8_t COLOR_ORDER;
uint16_t LED_CURRENT = 450;

