serifpersia/pianolux-esp32/ESP32_PianoLux/ESP32_PianoLux.ino
uint8_t WIFI_MODE;
uint8_t CLIENT_LOGGER;

unsigned long currentTime = 0;
unsigned long previousTime = 0;
unsigned long previousFadeTime = 0;

unsigned long interval = 20;      // General refresh interval in milliseconds
unsigned long fadeInterval = 20;  // General fade interval in milliseconds

const uint8_t MAX_VELOCITY = 127;

const uint8_t COMMAND_SET_COLOR = 255;
const uint8_t COMMAND_FADE_RATE = 254;
const uint8_t COMMAND_ANIMATION = 253;
const uint8_t COMMAND_BLACKOUT = 252;
const uint8_t COMMAND_SPLASH = 251;
const uint8_t COMMAND_SET_BRIGHTNESS = 250;
const uint8_t COMMAND_KEY_OFF = 249;
const uint8_t COMMAND_SPLASH_MAX_LENGTH = 248;
const uint8_t COMMAND_SET_BG = 247;
const uint8_t COMMAND_VELOCITY = 246;
const uint8_t COMMAND_STRIP_DIRECTION = 245;
const uint8_t COMMAND_SET_GUIDE = 244;
const uint8_t COMMAND_SET_LED_VISUALIZER = 243;


uint8_t MODE = COMMAND_SET_COLOR;

uint8_t serverMode;

uint8_t animationIndex;
uint8_t numConnectedClients = 0;
uint8_t splashMaxLength = 8;
uint8_t SPLASH_HEAD_FADE_RATE = 5;

CRGBPalette16 currentPalette;
TBlendType currentBlending;

extern CRGBPalette16 myRedWhiteBluePalette;
extern const TProgmemPalette16 myRedWhiteBluePalette_p PROGMEM;

float distance(CRGB color1, CRGB color2) {
  return sqrt(pow(color1.r - color2.r, 2) + pow(color1.g - color2.g, 2) + pow(color1.b - color2.b, 2));
}

#if BOARD_TYPE == ESP32S3 || BOARD_TYPE == ESP32S2
// Function definitions (outside midiTask())
void handleMidiPlayerNoteOn(uint8_t channel, uint8_t note, uint8_t velocity) {
  noteOn(note, velocity);
  sendUSBMIDINoteOn(channel, note, velocity);
}

void handleMidiPlayerNoteOff(uint8_t channel, uint8_t note, uint8_t velocity) {
  noteOff(note);
  sendUSBMIDINoteOff(channel, note, velocity);
}

void handleMidiPlayerControlChange(uint8_t channel, uint8_t controller, uint8_t value) {
  sendUSBMIDIControlChange(channel, controller, value);
}
#endif

void handlePlaybackComplete() {
  notifyClients("{\"status\":\"info\", \"message\":\"MIDI playback finished: " + currentLoadedFile + "\"}"); // Now accessible
}

void loadConfig() {
  File configFile = LittleFS.open("/config.cfg", "r");
  if (configFile) {
    size_t size = configFile.size();
    std::unique_ptr<char[]> buf(new char[size]);
    configFile.readBytes(buf.get(), size);

    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, buf.get());

    if (error) {
      WebSerial.println("Failed to parse config file");
      return;
    }

    // Update configuration variables
    LED_PIN = doc["LED_PIN"] | LED_PIN;
    COLOR_ORDER = doc["COLOR_ORDER"] | COLOR_ORDER;
    LED_CURRENT = doc["LED_CURRENT"] | LED_CURRENT;
    WIFI_MODE = doc["WIFI_MODE"] | WIFI_MODE;
    CLIENT_LOGGER = doc["CLIENT_LOGGER"] | CLIENT_LOGGER;
    // Add more variables as needed

    configFile.close();
  } else {
    WebSerial.println("Failed to open config file for reading");
  }
}

void updateConfigFile(const char* configKey, uint16_t newValue) {
  JsonDocument doc;

  // Read the existing config file
  File configFile = LittleFS.open("/config.cfg", "r");
  if (configFile) {
    size_t size = configFile.size();
    std::unique_ptr<char[]> buf(new char[size]);
    configFile.readBytes(buf.get(), size);
    configFile.close();

    // Deserialize the JSON document
    DeserializationError error = deserializeJson(doc, buf.get());

    if (error) {
      WebSerial.println("Failed to parse config file");
      return;
    }

    // Update the specified config key with the new value
    doc[configKey] = newValue;

    // Save the updated config file
    File updatedConfigFile = LittleFS.open("/config.cfg", "w");
    if (updatedConfigFile) {
      if (serializeJson(doc, updatedConfigFile) == 0) {
        WebSerial.println("Failed to write updated config file");
      }
      updatedConfigFile.close();
      WebSerial.println("Config file updated successfully");
    } else {
      WebSerial.println("Failed to open config file for writing");
    }
  } else {
    WebSerial.println("Failed to open config file for reading");
  }
}

void initializeLEDStrip(uint8_t colorMode) {
  switch (colorMode) {
    case 0:
      wsstripGRB = new ESP32RMT_WS2812B<GRB>(LED_PIN);
      FastLED.addLeds(wsstripGRB, leds, NUM_LEDS);
      break;
    case 1:
      wsstripRGB = new ESP32RMT_WS2812B<RGB>(LED_PIN);
      FastLED.addLeds(wsstripRGB, leds, NUM_LEDS);
      break;
    case 2:
      wsstripBRG = new ESP32RMT_WS2812B<BRG>(LED_PIN);
      FastLED.addLeds(wsstripBRG, leds, NUM_LEDS);
      break;
    // Add more cases if needed
    default:
      // Handle default case if colorMode is not 0, 1, or 2
      break;
  }
  FastLED.setMaxPowerInVoltsAndMilliamps(5, LED_CURRENT);  // set power limit
  FastLED.setBrightness(DEFAULT_BRIGHTNESS);
}

// Function to send the current status to clients (implement this)
void sendPlaybackStatus(uint8_t num = 255) { // 255 means broadcast
  PlaybackState state = midiPlayer.getState();
  String statusStr;
  switch (state) {
    case PlaybackState::STOPPED:  statusStr = "stopped"; break;
    case PlaybackState::PLAYING:  statusStr = "playing"; break;
    case PlaybackState::PAUSED:   statusStr = "paused";  break;
    default: statusStr = "unknown"; break;
  }

  // Create JSON payload
  DynamicJsonDocument doc(256);
  doc["status"] = "playbackState"; // Use "status" as the identifier field
  doc["state"] = statusStr;
  // Only include filename if relevant (playing, paused, or just finished)
  if (state == PlaybackState::PLAYING || state == PlaybackState::PAUSED) {
    doc["filename"] = currentLoadedFile; // Use the renamed variable
  } else {
    doc["filename"] = ""; // Or null? Empty string is fine.
  }

  String jsonOutput;
  serializeJson(doc, jsonOutput);

  if (num == 255) {
    webSocket.broadcastTXT(jsonOutput); // Send to all clients
  } else {
    webSocket.sendTXT(num, jsonOutput); // Send to specific client
  }
}

void StartupAnimation() {
  for (uint8_t i = 0; i < NUM_LEDS; i++) {
    leds[i] = CHSV(getHueForPos(i), 255, 255);
    FastLED.show();
    leds[i] = CHSV(0, 0, 0);
  }
  FastLED.show();
}

bool startPortal = true;  // Start WiFi Manager Captive Portal

const uint8_t wmJumperPin = 15;  // Jumper pin for WiFi Manager Captive Portal
const uint8_t apJumperPin = 16;      // Jumper pin for AP mode

void startWmPortal(WiFiManager& wifiManager) {
  if (!wifiManager.startConfigPortal("PianoLux Portal")) {
    ESP.restart();
  }
}

void startAP() {
  // Start ESP32 in AP mode
  WiFi.softAP("PianoLux AP");
}

