serifpersia/pianolux-esp32/ESP32_PianoLux/ESP32_PianoLux.ino
void startSTA(WiFiManager& wifiManager) {

  startPortal = false;

  // Start WiFi Manager for configuring STA mode

  //Try to connect within 5 seconds
  wifiManager.setConnectTimeout(5);
  // Set callback to be invoked when configuration is updated
  wifiManager.setSaveConfigCallback([]() {
    WebSerial.println("Configurations updated");
    ESP.restart();
  });

  if (!wifiManager.autoConnect("PianoLux Portal")) {
    wifiManager.resetSettings();
    ESP.restart();
  }
}

#if USE_ARDUINO_OTA
void setupArduinoOTA()
{
  ArduinoOTA.setHostname("PianoLux-ESP32-OTA");

  ArduinoOTA
  .onStart([]() {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH)
      type = "sketch";
    else // U_LittleFS
      type = "filesystem";

    // NOTE: if updating LittleFS this would be the place to unmount LittleFS using LittleFS.end()
    WebSerial.println("Start updating " + type);
  })
  .onEnd([]() {
    WebSerial.println("\nEnd");
  })
  .onProgress([](unsigned int progress, unsigned int total) {
    WebSerial.printf("Progress: %u%%\r", (progress / (total / 100)));
  })
  .onError([](ota_error_t error) {
    WebSerial.printf("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) WebSerial.println("Auth Failed");
    else if (error == OTA_BEGIN_ERROR) WebSerial.println("Begin Failed");
    else if (error == OTA_CONNECT_ERROR) WebSerial.println("Connect Failed");
    else if (error == OTA_RECEIVE_ERROR) WebSerial.println("Receive Failed");
    else if (error == OTA_END_ERROR) WebSerial.println("End Failed");
  });

  ArduinoOTA.begin();
}
#endif


void handleLog(MidiLogLevel level, const char* message) {
  const char* levelStr = "";
  switch (level) {
    case MidiLogLevel::ERROR:
      levelStr = "[ERR] "; // Errors that might halt playback or indicate corruption
      break;
    case MidiLogLevel::WARN:
      levelStr = "[WRN] "; // Warnings about unexpected data or potential issues
      break;
    case MidiLogLevel::INFO:
      levelStr = "[INF] "; // General information (playback start/stop, file loaded)
      break;
    case MidiLogLevel::DEBUG:
      levelStr = "[DBG] "; // Detailed debugging steps (event parsing, byte reads)
      break;
    case MidiLogLevel::VERBOSE:
      levelStr = "[VER] "; // Extremely detailed info (often too noisy)
      break;
    // case MidiLogLevel::NONE: // No need to handle NONE, the library checks this
    default:
      levelStr = "[???] "; // Unknown level? Should not happen.
      break;
  }
  // Print the prefix and the message, followed by a newline
  WebSerial.printf("%s%s\n", levelStr, message);
}

void setup() {

  pinMode(wmJumperPin, INPUT_PULLUP);
  pinMode(apJumperPin, INPUT_PULLUP);

  WiFiManager wifiManager;

  if (!LittleFS.begin()) {
    return;
  }

  loadConfig();

  if (digitalRead(wmJumperPin) == LOW || WIFI_MODE == 1) {
    if (WIFI_MODE == 1)
    {
      WIFI_MODE = 0;
      updateConfigFile("WIFI_MODE", WIFI_MODE);
    }
    startWmPortal(wifiManager);
  } else if (digitalRead(apJumperPin) == LOW || WIFI_MODE == 2) {
    startAP();
  } else {
    startSTA(wifiManager);
  }


  WebSerial.begin(&server);
  WebSerial.println("Booting...");


  WebSerial.println("IP address: ");
  WebSerial.println(WiFi.localIP());


  // Initialize and start mDNS
  if (MDNS.begin("pianolux")) {
    WebSerial.println("MDNS Responder Started!");
  }

  server.on("/api/storage", HTTP_GET, handleStorageInfo);
  server.on("/api/files", HTTP_GET, handleFileList);
  server.on("/api/upload", HTTP_POST, [](AsyncWebServerRequest * request) {
    request->send(200, "text/plain", "Upload Received");
  }, handleUpload);

  server.onNotFound([](AsyncWebServerRequest * request) {
    if (!handleFileRead(request)) {
      if (request->url() == "/" && LittleFS.exists("/index.html")) {
        request->send(LittleFS, "/index.html", "text/html");
      } else {
        WebSerial.printf("Not Found: %s\n", request->url().c_str());
        request->send(404, "text/plain", "Not Found");
      }
    }
  });

#if USE_ARDUINO_OTA
  setupArduinoOTA();
#endif

#if USE_ELEGANT_OTA
  ElegantOTA.begin(&server);
#endif

  server.begin();

  MDNS.addService("http", "tcp", 80);
  MDNS.addService("ws", "tcp", 81);

  // Initialize LED strip based on the loaded configuration
  initializeLEDStrip(COLOR_ORDER);

  webSocket.begin();
  webSocket.onEvent(webSocketEvent);

  StartupAnimation();
  if (!startPortal) {
    setIPLeds();
  }

#if BOARD_TYPE == ESP32S3 || BOARD_TYPE == ESP32S2
  // Create the MIDI Out Queue
  midiOutQueue = xQueueCreate(MIDI_OUT_QUEUE_SIZE, sizeof(MidiMessage));
  if (midiOutQueue == NULL) {
    ESP_LOGE("", "Failed to create MIDI Out Queue!");
    // Handle error appropriately, maybe halt?
  }
#endif

  MIDI.begin();

  AppleMIDI.setHandleConnected([](const APPLEMIDI_NAMESPACE::ssrc_t& ssrc, const char* name) {
    isConnected++;
    WebSerial.print("Connected to session ");
    WebSerial.print(ssrc);
    WebSerial.print(" Name ");
    WebSerial.println(name);
  });

  AppleMIDI.setHandleDisconnected([](const APPLEMIDI_NAMESPACE::ssrc_t& ssrc) {
    isConnected--;
    WebSerial.print("Disconnected ");
    WebSerial.println(ssrc);
  });

  MIDI.setHandleNoteOn([](byte channel, byte note, byte velocity) {
    if (isConnected) {
      noteOn(note, velocity);
#if BOARD_TYPE == ESP32S3 || BOARD_TYPE == ESP32S2
      sendUSBMIDINoteOn(channel, note, velocity);
#endif
      if (numConnectedClients != 0)
      {
        sendESP32Log("RTP MIDI IN: NOTE ON: Channel: " + String(channel) + " Pitch: " + String(note) + " Velocity: " + String(velocity));
      }
    }
  });
  MIDI.setHandleNoteOff([](byte channel, byte note, byte velocity) {
    if (isConnected) {
      noteOff(note);
#if BOARD_TYPE == ESP32S3 || BOARD_TYPE == ESP32S2
      sendUSBMIDINoteOff(channel, note, velocity);
#endif
      if (numConnectedClients != 0 && CLIENT_LOGGER)
        sendESP32Log("RTP MIDI IN: NOTE OFF: Channel: " + String(channel) + " Pitch: " + String(note) + " Velocity: " + String(velocity));
    }
  });

