serifpersia/pianolux-esp32/ESP32_PianoLux/ESP32_PianoLux.ino
  MIDI.setHandleControlChange([](byte channel, byte controller, byte value) {
    if (isConnected) {
#if BOARD_TYPE == ESP32S3 || BOARD_TYPE == ESP32S2
      sendUSBMIDIControlChange(channel, controller, value);
#endif
      if (numConnectedClients != 0 && CLIENT_LOGGER)
      {
        sendESP32Log("RTP MIDI IN: CC "  + String(channel) + "" + String(controller) + " Value: " + String(value));
      }
    }

  });

#if BOARD_TYPE == ESP32S3 || BOARD_TYPE == ESP32
  BLEMidiClient.begin("PianoLux-BLE");
  //BLEMidiClient.enableDebugging();
  BLEMidiClient.setNoteOnCallback(BLE_onNoteOn);
  BLEMidiClient.setNoteOffCallback(BLE_onNoteOff);
  BLEMidiClient.setControlChangeCallback(BLE_onControlChange);
#endif

  // USB setup
#if BOARD_TYPE == ESP32S3 || BOARD_TYPE == ESP32S2
  usbh_setup(show_config_desc_full);  // Init USB host for MIDI devices

  midiOutBusy = false;
#endif

  //midiPlayer.setLogCallback(handleLog);
  //midiPlayer.setLogLevel(MidiLogLevel::DEBUG);


  // MIDI Playback Callbacks
#if BOARD_TYPE == ESP32S3 || BOARD_TYPE == ESP32S2
  midiPlayer.setNoteOnCallback(handleMidiPlayerNoteOn);
  midiPlayer.setNoteOffCallback(handleMidiPlayerNoteOff);
  midiPlayer.setControlChangeCallback(handleMidiPlayerControlChange);
  midiPlayer.setPlaybackCompleteCallback(handlePlaybackComplete);
#endif

}

void loop() {

  MIDI.read();

  // Check MIDI player state changes
  static PlaybackState lastState = midiPlayer.getState();
  PlaybackState currentState = midiPlayer.getState();
  if (currentState != lastState) {
    sendPlaybackStatus();

    // reset leds
    fill_solid(leds, NUM_LEDS, bgColor);

    lastState = currentState;
  }


  // USB MIDI OUT
#if BOARD_TYPE == ESP32S3 || BOARD_TYPE == ESP32S2
  handleUSBMidiOut();
#endif

  // Handle USB
#if BOARD_TYPE == ESP32S3 || BOARD_TYPE == ESP32S2
  usbh_task();
#endif


  midiPlayer.tick();


#if USE_ARDUINO_OTA
  ArduinoOTA.handle();
#endif

#if USE_ELEGANT_OTA
  ElegantOTA.loop();
#endif

  webSocket.loop();  // Update function for the webSockets

  if (serverMode == 2) {
    // Update hue for LEDs that are currently on
    for (uint8_t i = 0; i < NUM_LEDS; i++) {
      if (keysOn[i]) {
        currentHue[i] = (currentHue[i] + HUE_CHANGE_SPEED) % 256;
        controlLeds(i, currentHue[i], saturation, brightness);
      }
    }
  }

  currentTime = millis();

  //slowing it down with interval
  if (currentTime - previousTime >= interval) {
    for (uint8_t i = 0; i < numEffects; i++) {
      if (effects[i]->finished()) {
        delete effects[i];
        removeEffect(effects[i]);
      } else {
        effects[i]->nextStep();
      }
    }
    previousTime = currentTime;
  }
  if (currentTime - previousFadeTime >= fadeInterval) {
    if (numEffects > 0 || generalFadeRate > 0) {
      fadeCtrl->fade(generalFadeRate);
    }
    previousFadeTime = currentTime;
  }
  switch (MODE) {
    case COMMAND_ANIMATION:
      if (animationIndex == 7) {
        // If the selected animation is 7, run the sineWave() animation
        sineWave();
      } else if (animationIndex == 8) {
        // If the selected animation is 7, run the sineWave() animation
        sparkleDots();
      } else if (animationIndex == 9) {
        // If the selected animation is 7, run the sineWave() animation
        Snake();
      } else {
        // For other animations (0 to 6), use the palette-based approach
        Animatons(animationIndex);
        static uint8_t startIndex = 0;
        startIndex = startIndex + 1; /* motion speed */
        FillLEDsFromPaletteColors(startIndex);
      }
      break;
  }
  FastLED.show();
}

#if BOARD_TYPE == ESP32S3 || BOARD_TYPE == ESP32S2
void handleUSBMidiOut()
{
  if (isMIDIReady && !midiOutBusy && midiOutQueue != NULL && uxQueueMessagesWaiting(midiOutQueue) > 0) {
    MidiMessage msgToSend;
    // Check if a message is available without blocking
    if (xQueueReceive(midiOutQueue, &msgToSend, 0) == pdPASS) {

      // Prepare USB MIDI Packet
      uint8_t cableNumber = 0; // Typically 0
      uint8_t cin = 0;         // Code Index Number

      switch (msgToSend.status & 0xF0) {
        case 0x80: cin = 0x08; break; // Note Off
        case 0x90: cin = 0x09; break; // Note On
        case 0xA0: cin = 0x0A; break; // Poly Key Pressure
        case 0xB0: cin = 0x0B; break; // Control Change
        case 0xC0: cin = 0x0C; break; // Program Change
        case 0xD0: cin = 0x0D; break; // Channel Pressure
        case 0xE0: cin = 0x0E; break; // Pitch Bend
        // case 0xF0: // System messages might need special handling (CIN 0xF or others)
        default:
          ESP_LOGW("", "Unsupported MIDI status for USB OUT: 0x%02X", msgToSend.status);
          // Skip this message or handle appropriately
          goto skip_submit; // Use goto sparingly, or restructure
      }

      // Check if MIDIOut is valid (should be if isMIDIReady is true, but double-check)
      if (!MIDIOut) {
        ESP_LOGE("", "MIDIOut is NULL despite isMIDIReady being true!");
        // Maybe try to re-queue? xQueueSendToFront(midiOutQueue, &msgToSend, 0);
        goto skip_submit;
      }

      // Construct the 4-byte USB MIDI packet
      MIDIOut->data_buffer[0] = (cableNumber << 4) | cin;
      MIDIOut->data_buffer[1] = msgToSend.status | (msgToSend.channel & 0x0F);
      MIDIOut->data_buffer[2] = msgToSend.data1 & 0x7F;
      MIDIOut->data_buffer[3] = msgToSend.data2 & 0x7F;
      MIDIOut->num_bytes = 4; // USB MIDI packets are always 4 bytes

      // Mark busy BEFORE submitting
      midiOutBusy = true;

      // Submit the transfer
      esp_err_t err = usb_host_transfer_submit(MIDIOut);

      if (err != ESP_OK) {
        ESP_LOGE("", "MIDI OUT transfer submit failed: %s", esp_err_to_name(err));
        // IMPORTANT: Mark as not busy if submit failed, so we can try again later
        midiOutBusy = false;
        // Optional: Re-queue the message to try again later?
        // xQueueSendToFront(midiOutQueue, &msgToSend, 0); // Put it back at the front
      } else {
        // **** Log SUCCESSFUL submission here ****
        uint8_t statusNibble = msgToSend.status & 0xF0; // Get the high nibble

