serifpersia/pianolux-esp32/ESP32_PianoLux/ESP32_PianoLux.ino
        if (statusNibble == 0x90) { // Note On
          //WebSerial.printf("MIDI Player ON Events during sendusb: Note=%u, Vel=%u\n", msgToSend.data1, msgToSend.data2);
        } else if (statusNibble == 0x80) { // Note Off
          //WebSerial.printf("MIDI Player OFF Events during sendusb: Note=%u, Vel=%u\n", msgToSend.data1, msgToSend.data2);
        } else if (statusNibble == 0xB0) { // Control Change <<<--- ADD THIS
          //WebSerial.printf("MIDI Player CC Events during sendusb: Ctrl=%u, Val=%u\n", msgToSend.data1, msgToSend.data2);
        }
      }
    } // end if xQueueReceive
  } // end if !midiOutBusy && messages waiting
skip_submit:; // Label for goto, or restructure to avoid it

}
#endif

void controlLeds(uint8_t ledNo, uint8_t hueVal, uint8_t saturationVal, uint8_t brightnessVal) {
  if (ledNo < 0 || ledNo >= NUM_LEDS) {
    WebSerial.println("Invalid LED index");
    return;
  }
  // Convert HSB values to RGB values
  CRGB color = CHSV(hueVal, saturationVal, brightnessVal);
  leds[ledNum(ledNo)] = color;  // Set the LED color
  FastLED.show();               // Update the LEDs with the new color
}

uint8_t mapMidiNoteToLED(uint8_t midiNote, uint8_t lowestMidiNote, uint8_t highestMidiNote, uint8_t endIndex) {

  // Calculate the LED index using linear mapping
  uint8_t startIndex = 0;

  // Define the threshold notes where the shifts will occur
  uint8_t shiftThreshold1 = 57;  // MIDI note for A3
  uint8_t shiftThreshold2 = 93;  // MIDI note for C7

  // Calculate the LED index using linear mapping
  uint8_t ledIndex = map(midiNote, lowestMidiNote, highestMidiNote, startIndex, endIndex - 1);

  // Check if the useFix is equal to 1
  if (useFix == 1) {
    // Check if the MIDI note is beyond the first threshold for shifting
    if (midiNote >= shiftThreshold1) {
      // Shift all LEDs, including the A3 LED, to the left by 1 LED
      ledIndex -= 1;
    }

    // Check if the MIDI note is beyond the second threshold for shifting
    if (midiNote >= shiftThreshold2) {
      // Shift all LEDs, including the 93 MIDI note LED, to the left by 1 LED
      ledIndex -= 1;
    }
  }

  if (pianoScaleRatio == 1) {
    return startIndex + (midiNote - lowestNote);
  } else {
    return ledIndex;
  }
}

unsigned long previousNoteOnTime = 0;
uint8_t previousRandomHue = 0;
uint8_t firstNoteHue = 0;

void noteOn(uint8_t note, uint8_t velocity) {
  uint8_t ledIndex = mapMidiNoteToLED(note, lowestNote, highestNote, NUM_LEDS);  // Map MIDI note to LED index
  keysOn[ledIndex] = true;

  if (serverMode == 0) {
    controlLeds(ledIndex, hue, saturation, brightness);  // Both use the same index
  } else if (serverMode == 1) {
    CHSV hsv(hue, saturation, brightness);
    addEffect(new FadingRunEffect(splashMaxLength, ledIndex, hsv, SPLASH_HEAD_FADE_RATE, velocity));
  } else   if (serverMode == 2) {
    // Check time difference between the current note-on and the previous one
    unsigned long currentTime = millis();
    unsigned long timeDifference = currentTime - previousNoteOnTime;

    // Assign the same hue as the first note within the chord time window
    if (timeDifference <= 600) {  // Adjust this chord threshold as needed
      currentHue[ledIndex] = firstNoteHue;
    } else if (timeDifference <= 50) {  // Adjust this second threshold as needed
      // Use a slightly different hue for notes close to the first note within the chord time window
      currentHue[ledIndex] = firstNoteHue + 10; // Adjust the increment value as needed
    } else {
      // Generate a new random hue for this note-on event
      uint8_t newRandomHue = random(256);
      currentHue[ledIndex] = newRandomHue;

      // Update the time and hue of the first note within the chord time window
      previousNoteOnTime = currentTime;
      firstNoteHue = newRandomHue;
    }
    controlLeds(ledIndex, currentHue[ledIndex], saturation, brightness);
  } else if (serverMode == 3) {
    uint8_t hue, saturation, brightness;
    setColorFromVelocity(velocity, hue, saturation, brightness);
    controlLeds(ledIndex, hue, saturation, brightness);
  }
  //Split Mode
  else if (serverMode == 5) {
    // Split Mode
    uint8_t splitIndex = map(note, splitLeftMinPitch, splitRightMaxPitch, 0, 100);

    if (splitIndex <= splitPosition) {
      // Use left color
      controlLeds(ledIndex, splitLeftColor.h, splitLeftColor.s, splitLeftColor.v);
    } else {
      // Use right color
      controlLeds(ledIndex, splitRightColor.h, splitRightColor.s, splitRightColor.v);
    }
  }
  //WebSerial.println("Note On: " + String(note) + " mapped to LED: " + String(ledIndex));  // Debug print
}

void noteOff(uint8_t note) {
  uint8_t ledIndex = mapMidiNoteToLED(note, lowestNote, highestNote, NUM_LEDS);  // Map MIDI note to LED index
  keysOn[ledIndex] = false;
  //WebSerial.println("Note Off: " + String(note) + " mapped to LED: " + String(ledIndex));  // Debug print
}

void sliderAction(uint8_t sliderNumber, uint8_t value) {
  if (sliderNumber == 1) {
    hue = value;
  } else if (sliderNumber == 2) {
    DEFAULT_BRIGHTNESS = value;
    FastLED.setBrightness(DEFAULT_BRIGHTNESS);
  } else if (sliderNumber == 3) {
    generalFadeRate = value;
  } else if (sliderNumber == 4) {
    splashMaxLength = value;
  } else if (sliderNumber == 5) {
    bgBrightness = value;
  } else if (sliderNumber == 6) {
    saturation = value;
  }
  WebSerial.print("Slider ");
  WebSerial.print(sliderNumber);
  WebSerial.print(" Value: ");
  WebSerial.println(value);
}

//Change LED Mode
void changeLEDModeAction(uint8_t serverMode) {
  blackout();
  generalFadeRate = 255;

  //Default Mode
  if (serverMode == 0) {
    MODE = COMMAND_SET_COLOR;
  }
  //Splash Mode
  else if (serverMode == 1) {
    generalFadeRate = 50;
    MODE = COMMAND_SPLASH;

  }

  //Velocity Mode
  else if (serverMode == 3) {
    MODE = COMMAND_VELOCITY;
  }
  //Animation Mode
  else if (serverMode == 4) {
    MODE = COMMAND_ANIMATION;
    generalFadeRate = 0;
  }
}
void blackout() {
  fill_solid(leds, NUM_LEDS, bgColor);
  MODE = COMMAND_BLACKOUT;
}

